; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	image3 - mode
	infrared1 - mode
	spectrograph0 - mode
	image2 - mode
	GroundStation1 - direction
	Star0 - direction
	GroundStation2 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 image2)
	(calibration_target instrument2 Star0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 image3)
	(calibration_target instrument4 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon11)
	(supports instrument5 infrared1)
	(calibration_target instrument5 Star0)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet21)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared1)
	(supports instrument6 image2)
	(calibration_target instrument6 Star0)
	(supports instrument7 infrared1)
	(supports instrument7 image2)
	(supports instrument7 image3)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star16)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 image2)
	(supports instrument9 spectrograph0)
	(supports instrument9 infrared1)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
)
(:goal (and
	(pointing satellite1 Star16)
	(have_image Phenomenon4 infrared1)
	(have_image Phenomenon5 image2)
	(have_image Star6 infrared1)
	(have_image Star7 image3)
	(have_image Planet8 spectrograph0)
	(have_image Planet9 infrared1)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon11 image2)
	(have_image Planet12 image2)
	(have_image Star13 image3)
	(have_image Planet14 image3)
	(have_image Star15 image3)
	(have_image Star16 infrared1)
	(have_image Phenomenon17 image3)
	(have_image Phenomenon18 infrared1)
	(have_image Star19 spectrograph0)
	(have_image Planet20 image2)
	(have_image Planet21 infrared1)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 19
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 19
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 19
4. (turn_to satellite3 groundstation2 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 19
5. (calibrate satellite3 instrument7 groundstation2)
   added: (calibrated instrument7)
   goals met: 0 of 19
6. (turn_to satellite3 phenomenon10 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon10)
   goals met: 0 of 19
7. (take_image satellite3 phenomenon10 instrument7 image3)
   added: (have_image phenomenon10 image3)
   goals met: 1 of 19
8. (turn_to satellite3 phenomenon11 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 phenomenon11)
   goals met: 1 of 19
9. (take_image satellite3 phenomenon11 instrument7 image2)
   added: (have_image phenomenon11 image2)
   goals met: 2 of 19
10. (turn_to satellite3 phenomenon17 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon17)
   goals met: 2 of 19
11. (take_image satellite3 phenomenon17 instrument7 image3)
   added: (have_image phenomenon17 image3)
   goals met: 3 of 19
12. (turn_to satellite3 phenomenon18 phenomenon17)
   deleted: (pointing satellite3 phenomenon17)
   added: (pointing satellite3 phenomenon18)
   goals met: 3 of 19
13. (take_image satellite3 phenomenon18 instrument7 infrared1)
   added: (have_image phenomenon18 infrared1)
   goals met: 4 of 19
14. (turn_to satellite3 phenomenon4 phenomenon18)
   deleted: (pointing satellite3 phenomenon18)
   added: (pointing satellite3 phenomenon4)
   goals met: 4 of 19
15. (take_image satellite3 phenomenon4 instrument7 infrared1)
   added: (have_image phenomenon4 infrared1)
   goals met: 5 of 19
16. (turn_to satellite3 phenomenon5 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 phenomenon5)
   goals met: 5 of 19
17. (take_image satellite3 phenomenon5 instrument7 image2)
   added: (have_image phenomenon5 image2)
   goals met: 6 of 19
18. (turn_to satellite3 planet12 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 planet12)
   goals met: 6 of 19
19. (take_image satellite3 planet12 instrument7 image2)
   added: (have_image planet12 image2)
   goals met: 7 of 19
20. (turn_to satellite3 planet14 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 planet14)
   goals met: 7 of 19
21. (take_image satellite3 planet14 instrument7 image3)
   added: (have_image planet14 image3)
   goals met: 8 of 19
22. (turn_to satellite3 planet20 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet20)
   goals met: 8 of 19
23. (take_image satellite3 planet20 instrument7 image2)
   added: (have_image planet20 image2)
   goals met: 9 of 19
24. (turn_to satellite3 planet21 planet20)
   deleted: (pointing satellite3 planet20)
   added: (pointing satellite3 planet21)
   goals met: 9 of 19
25. (take_image satellite3 planet21 instrument7 infrared1)
   added: (have_image planet21 infrared1)
   goals met: 10 of 19
26. (turn_to satellite3 planet9 planet21)
   deleted: (pointing satellite3 planet21)
   added: (pointing satellite3 planet9)
   goals met: 10 of 19
27. (take_image satellite3 planet9 instrument7 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 11 of 19
28. (turn_to satellite3 star13 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star13)
   goals met: 11 of 19
29. (take_image satellite3 star13 instrument7 image3)
   added: (have_image star13 image3)
   goals met: 12 of 19
30. (turn_to satellite3 star15 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star15)
   goals met: 12 of 19
31. (take_image satellite3 star15 instrument7 image3)
   added: (have_image star15 image3)
   goals met: 13 of 19
32. (turn_to satellite3 star16 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 star16)
   goals met: 13 of 19
33. (take_image satellite3 star16 instrument7 infrared1)
   added: (have_image star16 infrared1)
   goals met: 14 of 19
34. (turn_to satellite3 star6 star16)
   deleted: (pointing satellite3 star16)
   added: (pointing satellite3 star6)
   goals met: 14 of 19
35. (take_image satellite3 star6 instrument7 infrared1)
   added: (have_image star6 infrared1)
   goals met: 15 of 19
36. (turn_to satellite3 star7 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 star7)
   goals met: 15 of 19
37. (take_image satellite3 star7 instrument7 image3)
   added: (have_image star7 image3)
   goals met: 16 of 19
38. (turn_to satellite1 star16 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star16)
   goals met: 17 of 19
39. (turn_to satellite0 groundstation1 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation1)
   goals met: 17 of 19
40. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 17 of 19
41. (turn_to satellite0 planet8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet8)
   goals met: 17 of 19
42. (take_image satellite0 planet8 instrument0 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 18 of 19
43. (turn_to satellite0 star19 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star19)
   goals met: 18 of 19
44. (take_image satellite0 star19 instrument0 spectrograph0)
   added: (have_image star19 spectrograph0)
   goals met: 19 of 19
